app/controllers/api/blogs_controller.rb

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @blog = Blog.find_by(id: params[:id])

INSERT INTO "blogs" ("title", "body", "author_id", "created_at", "updated_at", "media_type") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "An apple a day"], ["body", "myself"], ["author_id", 1], ["created_at", "2020-08-25 20:43:15.639497"], ["updated_at", "2020-08-25 20:43:15.639497"], ["media_type", "quote"]]
---
    def create
        @blog = Blog.new(blog_params)
        if @blog.save!

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
UPDATE "blogs" SET "body" = $1, "updated_at" = $2 WHERE "blogs"."id" = $3  [["body", "testing photo with hardcoded id sixth time and this should work"], ["updated_at", "2020-08-26 04:43:29.476685"], ["id", 17]]
---
    def update
        # @blog = Blog.find_by(id: params[:blog][:formId])
        @blog = Blog.find_by(id: params[:id])
        # debugger
        if @blog && @blog.update!(blog_params)

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]
DELETE FROM "blogs" WHERE "blogs"."id" = $1  [["id", 29]]
---
    def destroy
        @blog = Blog.find_by(id: params[:id])
        if @blog
            @blog.destroy