app/controllers/api/likes_controller.rb

    def create
        @like = Like.new(like_params)
        if @like.save!
---
INSERT INTO "likes" ("blog_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["blog_id", 27], ["user_id", 4], ["created_at", "2020-08-26 23:56:41.986305"], ["updated_at", "2020-08-26 23:56:41.986305"]]

    def destroy
        @like = Like.find_by(id: params[:id])
        if @like
            @like.destroy
---
SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 9]]