app/views/api/users/index.json.jbuilder

        end
        json.user_following_count user.followee_users.length
---
SELECT "users".* FROM "users"