app/views/api/blogs/index.json.jbuilder

SELECT "likes".* FROM "likes" WHERE "likes"."blog_id" = $1  [["blog_id", 24]]
---
        end
        json.likeCount blog.likes.length